/************************************************************************
 * 名称：DS1302驱动
 * 简介：DS1302可能是上升沿输入，下降沿输出。LSB先发
 * 编写：邹应龙
 * 更新：2017-8-17  
 ************************************************************************/
 #include "../main.h"

/************************************************************************
 * 功能：忙循环nus
 * 描述：
 * 形参：
 * 返回：                       
 ************************************************************************/
static inline void ds1302_delay(void)
{
	_delay_us(25);
}

/************************************************************************
 * 功能：读芯片一个字节
 * 描述：下降沿读出
 * 形参：
 * 返回：数据                       
 ************************************************************************/
 static u8 ds1302_r_byte(void)
 {
     u8 data=0;
	 DS1302_IO_IN;			//对MCU来说，是输入
	 ds1302_delay();

     for(u8 i=0; i<8; i++)
     {

		DS1302_SCLK_L;
		ds1302_delay();

		data >>= 1;			//LSB
	    if(DS1302_IO_R)		//=1
			data |= 0x80;
	    else
			data &= 0x7F;
		DS1302_SCLK_H;			//先输出下降沿
		ds1302_delay();
     }
     
     return data;
 }

 /************************************************************************
 * 功能：写芯片一个字节
 * 描述：上升沿写入
 * 形参：数据
 * 返回：                 
 ************************************************************************/
static void ds1302_w_byte(u8 data)
{
    DS1302_IO_OUT;
	ds1302_delay();

    for(u8 i=0; i<8; i++)
    {		
	    if(data&0x01)		DS1302_IO_H;		//LSB
	    else				DS1302_IO_L;
	    data >>= 1;
		ds1302_delay();
		DS1302_SCLK_H;
		ds1302_delay();
		DS1302_SCLK_L;		

    }
    ds1302_delay();
}

/************************************************************************
 * 功能：写命令+数据
 * 描述：用于写单个字节的数据
 * 形参：命令(必为偶数)，十位，个位
 * 返回：                 
 ************************************************************************/
void ds1302_w_data(u8 cmd, u8 ten, u8 unit)
{
	u8 data = ((ten&0x0F)<<4) + (unit&0x0F);

	DS1302_RST_H;
	ds1302_delay();

	ds1302_w_byte(cmd);
	ds1302_w_byte(data);

	DS1302_RST_L;
	ds1302_delay();
}
/************************************************************************
 * 功能：读数据
 * 描述：用于读单个字节的数据
 * 形参：命令(必为奇数)
 * 返回：返回的数据                 
 ************************************************************************/
void ds1302_r_data(u8 cmd, vu8 *ten, vu8 *unit)
{
	u8 data;

	DS1302_RST_H;
	ds1302_delay();

	ds1302_w_byte(cmd);
	data = ds1302_r_byte();

	DS1302_RST_L;
	ds1302_delay();

	*ten = (data>>4)&0x0F;
	*unit = data&0x0F;
}

/************************************************************************
 * 功能：读当前时间
 * 描述：
 * 形参：
 * 返回：时间结构体                 
 ************************************************************************/
RTC_t rtc_read_time(void)
{
	RTC_t rtc;
	u8 tmp[8];

	DS1302_RST_H;
	ds1302_delay();
    ds1302_w_byte(0xBF);				//busrt连续读
	for (u8 i=0; i<8; i++)
	{
		tmp[i]	= ds1302_r_byte();
	}
    DS1302_RST_L;
    ds1302_delay();

	rtc.sec1	= tmp[0]&0x0F;
	rtc.sec10	= (tmp[0]>>4)&0x0F;

	rtc.min1	= tmp[1]&0x0F;
	rtc.min10	= (tmp[1]>>4)&0x0F;

	rtc.hour1	= tmp[2]&0x0F;
	rtc.hour10	= (tmp[2]>>4)&0x0F;

	rtc.date1	= tmp[3]&0x0F;
	rtc.date10	= (tmp[3]>>4)&0x0F;

	rtc.month1	= tmp[4]&0x0F;
	rtc.month10	= (tmp[4]>>4)&0x0F;

	u8 no		= tmp[5]&0x0F;

	rtc.year1	= tmp[6]&0x0F;
	rtc.year10	= (tmp[6]>>4)&0x0F;

	return rtc;
}

/************************************************************************
 * 功能：写当前时间
 * 描述：修改时间也要用
 * 形参：数据
 * 返回：                 
 ************************************************************************/
void rtc_write_time(RTC_t data) 
{
	ds1302_w_data(0x80, data.sec10, data.sec1);
	ds1302_w_data(0x82, data.min10, data.min1);
	ds1302_w_data(0x84, data.hour10, data.hour1);
	ds1302_w_data(0x86, data.date10, data.date1);
	ds1302_w_data(0x88, data.month10, data.month1);
	ds1302_w_data(0x8C, data.year10, data.year1);
}

/************************************************************************
 * 功能：初始化
 * 描述：读取时钟或写入0
 * 形参：
 * 返回：                 
 ************************************************************************/
void ds1302_init(void)
{
	ds1302_w_data(0x8E,0,0);
	ds1302_w_data(0x80,0,0);
} 
/************************************************************************
 * 功能：DEBUG
 * 描述：
 * 形参：
 * 返回：                 
*************************************************************************/
void ds1302_debug(void)
{
	// 解除写保护
	u8 *ten = 0;
	u8 *unit = 0;
	DS1302_RST_H;
	ds1302_delay();
	ds1302_w_data(0xC0,0,5);
	ds1302_r_data(0xC1,ten,unit);
	DS1302_RST_L;
	ds1302_delay();
	
	u16 debug = (*ten<<4) + *unit;
	gbvar_set(GB_DEBUG,debug);	
}